In [3]:
import pandas as pd

# Criando DataFrame - pd.DataFrame()
<p> Para criar um dataframe utilizaremos o comando pd.DataFrame, porém antes será necessário a criação de um dicionário de listas que representará, os valores e colunas. </p>

In [1]:
# Dicionário de listas
dataset_carros = {
    'Carro':['Chervrolet','Fiat','Uno','Volkswagen','Ford','Uno','Mercedes'],
    'Preco':[25000,30000,32000,31000,40000,32000,120000],
    'Desconto':['20%','30%','40%','10%','30%','40%','100%']
}

In [2]:
dataset_carros

{'Carro': ['Chervrolet',
  'Fiat',
  'Uno',
  'Volkswagen',
  'Ford',
  'Uno',
  'Mercedes'],
 'Preco': [25000, 30000, 32000, 31000, 40000, 32000, 120000],
 'Desconto': ['20%', '30%', '40%', '10%', '30%', '40%', '100%']}

In [4]:
# Comando Criação DataFrame
carros2 = pd.DataFrame(dataset_carros)

In [5]:
carros2.head()

        Carro  Preco Desconto
0  Chervrolet  25000      20%
1        Fiat  30000      30%
2         Uno  32000      40%
3  Volkswagen  31000      10%
4        Ford  40000      30%

# Organizando Dados - .sort_values() - .value_counts()

In [15]:
carros2

        Carro   Preco Desconto
0  Chervrolet   25000      20%
1        Fiat   30000      30%
2         Uno   32000      40%
3  Volkswagen   31000      10%
4        Ford   40000      30%
5         Uno   32000      40%
6    Mercedes  120000     100%

## .sort_values()
<p> Com sort_values podemos organizar nossos dados de maneira crescente ou decrescente </p>

In [43]:
carros2.sort_values(by='Preco')

        Carro  Preco Desconto  newcol  newcol2
0  Chervrolet  25000      20%    10.0       10
1        Fiat  30000      30%     4.0        4
3  Volkswagen  31000      10%    10.0       10
2         Uno  32000      40%     3.0        3

In [44]:
# preço decrescente
carros2.sort_values(by='Preco', ascending = False)

        Carro  Preco Desconto  newcol  newcol2
2         Uno  32000      40%     3.0        3
3  Volkswagen  31000      10%    10.0       10
1        Fiat  30000      30%     4.0        4
0  Chervrolet  25000      20%    10.0       10

In [159]:
# preço decrescente e desconto crescente
carros2.sort_values(by=['Preco','Desconto'], ascending = [False,True])

        Carro   Preco Desconto
6    Mercedes  120000     100%
4        Ford   40000      30%
2         Uno   32000      40%
5         Uno   32000      40%
3  Volkswagen   31000      10%
1        Fiat   30000      30%
0  Chervrolet   25000      20%

## .value_counts()
<p> Podemos criar um contagem da repetição de nossos dados (frequencia absoluta) dentro do nosso DataFrame </p>

In [53]:
carros2['Preco'].value_counts()

30000    1
31000    1
32000    1
25000    1
Name: Preco, dtype: int64

In [55]:
# criando uma frequencia relativa com value counts
carros2['Preco'].value_counts(normalize = True)

30000    0.25
31000    0.25
32000    0.25
25000    0.25
Name: Preco, dtype: float64

# Agrupando Dados - .groupby() - .pivot_table()

In [16]:
carros2

        Carro   Preco Desconto
0  Chervrolet   25000      20%
1        Fiat   30000      30%
2         Uno   32000      40%
3  Volkswagen   31000      10%
4        Ford   40000      30%
5         Uno   32000      40%
6    Mercedes  120000     100%

## .groupby()
<p> Podemos agrupar nossos dados com base em um determinado conjunto de valores, utilizando alguma função. </p>

In [152]:
carros2.groupby('Carro').mean()

             Preco
Carro
Chervrolet   25000
Fiat         30000
Ford         40000
Mercedes    120000
Uno          32000
Volkswagen   31000

In [162]:
# Podemos utilizar o agg para aplicar mais de uma função
carros2.groupby('Carro').agg([min,max])['Preco']

               min     max
Carro
Chervrolet   25000   25000
Fiat         30000   30000
Ford         40000   40000
Mercedes    120000  120000
Uno          32000   32000
Volkswagen   31000   31000

## .pivot_table()
<p> As pivot_table funcionam como um groupby, só que com possibilidade de efetuar uma contagem de valores com <b>margins = True </b></p>

In [16]:
carros2.pivot_table(values='Preco',index='Carro',columns = 'Desconto', fill_value = 0,margins = True)

Desconto      10%    100%    20%    30%    40%     All
Carro
Chervrolet      0       0  25000      0      0   25000
Fiat            0       0      0  30000      0   30000
Ford            0       0      0  40000      0   40000
Mercedes        0  120000      0      0      0  120000
Uno             0       0      0      0  32000   32000
Volkswagen  31000       0      0      0      0   31000
All         31000  120000  25000  35000  32000   44285

## .crosstab()
<p> Mais uma maneira de organizar os dados </p>

In [8]:
pd.crosstab(carros2['Carro'],carros2['Desconto'],values=carros2['Preco'],aggfunc=np.average)

Desconto        10%      100%      20%      30%      40%
Carro
Chervrolet      NaN       NaN  25000.0      NaN      NaN
Fiat            NaN       NaN      NaN  30000.0      NaN
Ford            NaN       NaN      NaN  40000.0      NaN
Mercedes        NaN  120000.0      NaN      NaN      NaN
Uno             NaN       NaN      NaN      NaN  32000.0
Volkswagen  31000.0       NaN      NaN      NaN      NaN